// Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.

function getNumbers(min, max) {
  alert(
    "Task 7: Вивід чисел від максимального до мінімального та суми парних чисел в проміжку."
  );
  let result = 0;
  for (let i = max; i > min; i--) {
    console.log(i);
    if (i % 2 === 0) {
      result += i;
    }
  }

  return result;
}
console.log(getNumbers(1, 10));
