// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"

function checkLogin() {
  alert("Task 5: первірка логіна та пароля користувача");
  const login = prompt("Введіть логін");
  console.log(login);
  if (!login) {
    alert("Скасовано");
  } else if (login === "Адмін") {
    const password = prompt("Введіть пароль");
    if (!password) {
      alert("Скасовано");
    } else if (password === "Я головний") {
      alert("Добрий день!");
    } else alert("Невірний пароль");
  }
}

checkLogin();
