// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

function checkout() {
  alert("Task 2: перевірка на входження у четверть");
  const min = Number(prompt("Введіть число від 0 до 59"));

  if (min >= 0 && min < 15) {
    alert(`${min} входить в першу четверть`);
  } else if (min >= 15 && min < 30) {
    alert(`${min} входить в другу четверть`);
  } else if (min >= 30 && min < 45) {
    alert(`${min} входить в третю четверть`);
  } else if (min >= 45 && min < 60) {
    alert(`${min} входить в четверту четверть`);
  } else alert("Число має бути у проміжку від 0 до 59");
}

checkout();
